<?php
return [
    "show_level" => [
      '-1' => '不通过',
      '0'  => '未审',
      '1'  => "过审-宽松",
      '2'  => "过审-较严",
      '3'  => "过审-严审",
    ],
    "category_type" => [
      '100' => '二手市场'
    ],
    "label_type" => [
      '0' => '公共标签',
      '200' => '房屋转租',
      '300' => '活动',
    ],
    "common_notice_type" => [
      '1' => 'APP启动弹窗通知',
    ],

    "ads_type" => [
      '1' => 'APP启动广告图',
      '2' => '首页广告图',
    ],
    "idle_status" => [
      '-2' => '已取消出售',
      '-1' => '已卖出',
      '0' => '出售中',
      '1' => '推荐',
      '2' => '置顶',
    ],

];
