<?php
return [
    "reason" => [
        "-99" => "管理员操作",
        "-100" => "拼车减分",
        "-200" => "商品消费",
        "-201" => "积分抽奖",
        "-202" => "实物抽奖",
        "-300" => "系统操作",
        "-301" => "合并账号",
        "1" => "旧积分补入",
        "99" => "管理员操作",
        "100" => "拼车",
        "101" => "拼车不合法的强制放行操作",
        "102" => "拼车不合法的有限放行操作",
        "200" => "取消商品兑换",
        "201" => "积分抽奖",
        "300" => "系统操作",
        "301" => "合并账号",
    ],
    "reason_operable" => ['-99', '1', '99'],
    'platform' => [
        'Unknow', 'iOS', 'Android', 'H5', 'master'
    ],
    "account_type" => [
        ["name" => "score", "field" => "account"],
        ["name" => "phone", "field" => "phone"],
        ["name" => "carpool", "field" => "carpool_account"],
    ],
    "order_status" => [
        "-3" => "订单过期",
        "-2" => "订单无效",
        "-1" => "订单已取消",
        "0" => "等待兑换",
        "1" => "已兑换",
    ],
    "goods_status" => [
        "-2" => "下架",
        "-1" => "准备中",
        "0" => "正常",
        "1" => "推荐",
        "2" => "置顶",
    ],
    "prize_status" => [
        "-4" => "已开奖",
        "-3" => "开奖中",
        "-2" => "下架",
        "-1" => "准备中",
        "0" => "进行中",
        "1" => "推荐",
        "2" => "置顶",
    ],
    "rule_number" => [
        "0" => [
            "title" => "国内地区",
            "region" => "",
        ],
        "1" => [
            "title" => "越南地区",
            "region" => "Vietnam",
        ],
    ],
    "integral_number_department" => [
        "Esquel Group" => 0,
        "Esquel Group,Vietnam" => 1,
    ],
];
